modules/about/ui/atlas/chart.dot
digraph {
  edge [arrowhead="normal",color="white"]
  graph [layout="dot",bgcolor="#1c1c1c",rankdir="TB",ranksep="1.5"]
  node [shape="box",style="filled",fontcolor="white",color="transparent"]
  ":about:data" [fillcolor="#160185"]
  ":about:ui" [fillcolor="#6b6b01"]
  ":about:vm" [fillcolor="#914141"]
  ":api:github" [fillcolor="#160185"]
  ":budget:data" [fillcolor="#160185"]
  ":budget:model" [fillcolor="#160185"]
  ":codegen:annotation" [fillcolor="#160185"]
  ":core:di" [fillcolor="#a17103"]
  ":core:model" [fillcolor="#160185"]
  ":core:ui" [fillcolor="#6b6b01"]
  ":l10n" [fillcolor="#160185"]
  ":logging" [fillcolor="#160185"]
  ":about:data" -> ":api:github" [style="bold"]
  ":about:ui" -> ":about:vm" [style="bold"]
  ":about:ui" -> ":core:ui" [style="bold"]
  ":about:ui" -> ":l10n" [style="dashed"]
  ":about:vm" -> ":about:data" [style="bold"]
  ":about:vm" -> ":core:di" [style="bold"]
  ":about:vm" -> ":logging" [style="dashed"]
  ":api:github" -> ":codegen:annotation" [style="dashed"]
  ":api:github" -> ":core:model" [style="bold"]
  ":budget:data" -> ":budget:model" [style="bold"]
  ":budget:data" -> ":core:model" [style="bold"]
  ":budget:data" -> ":logging" [style="dashed"]
  ":core:di" -> ":budget:data" [style="bold"]
  ":core:di" -> ":budget:model" [style="bold"]
  ":core:ui" -> ":budget:model" [style="bold"]
  ":core:ui" -> ":core:di" [style="dashed"]
  ":core:ui" -> ":core:model" [style="bold"]
  ":core:ui" -> ":l10n" [style="dashed"]
}
